[
    {"name": "ゴールシーク", "content": "あなたは優秀なプロンプトエンジニアです。\n最高のChatGPTへのプロンプトを一緒に考えてください。\n以下のプロセスに従ってください。\n\n1. まず最初に、何についてのプロンプトであるかを私に確認してください。私が質問の答えを提供するので、次のステップを経て、継続的な反復を通じて改善してください。\n2. 私の入力に対して、3つのセクションを生成してください。A. 改訂されたプロンプト（書き直したプロンプトを提示。明確、簡潔で、簡単にあなたが理解できるもの）B. 提案（プロンプトを改善するために、プロンプトに含めるべき詳細を提案してください）C. 質問（プロンプトを改善するために必要な情報を、私に尋ねてください）\n3. このプロセスは、私があなたに追加情報を提供し、あなたが改訂されたプロンプトセクションのプロンプトを更新します。私が「完了」というまで続けてください。"},
    {"name": "論文要約", "content": "与えられた深層学習の論文を徹底的に要約してください。論文の章立てに沿って、各章について以下の点を含めて日本語で要約してください:\n\n提案された新しいアプローチやアイデアと、それが過去の研究とどう異なるか\n実験設定と使用したデータセット\n実験結果と、それが従来の手法にどのように勝るものであったか\n著者が主張する重要な発見事項と今後の課題\n適宜、専門用語を使用し、各章の要約はできるだけ簡潔にしつつ、重要な知見が欠落しないよう気をつけてください。\n\n必要に応じて、重要な数式、算法、図表の説明を含めてください。要約を段落で分けて構造化し、読みやすくします。参考文献リストの要約は不要です。Markdownの形式で見出しを管理してください．最大の見出しサイズは3にしてください．つまり，見出しサイズ3,4,5,6...のみを使ってください．導入や関連研究などは簡潔にまとめてください．この研究で新しく提案・解析・検証されている内容について中心的に詳しくまとめてください．理論解析の内容も詳しく説明してください．"},
    {"name": "論文要約（詳細）", "content": "与えられた深層学習の論文を徹底的に要約してください。論文の章立てに沿って、各章について以下の点を含めて日本語で要約してください:\n\n提案された新しいアプローチやアイデアと、それが過去の研究とどう異なるか\n実験設定と使用したデータセット\n実験結果と、それが従来の手法にどのように勝るものであったか\n著者が主張する重要な発見事項と今後の課題\n適宜、専門用語を使用し、各章の要約はできるだけ簡潔にしつつ、重要な知見が欠落しないよう気をつけてください。\n\n序論と関連研究のセクションをよく要約し、論文の背景と動機を明確にします。実験結果は数値だけでなく、その意味と重要性も説明します。結論セクションで全体の貢献をもう一度要約します。必要に応じて、重要な数式、算法、図表の説明を含めてください。要約を段落で分けて構造化し、読みやすくします。参考文献リストの要約は不要です。\n\nまず１章目について書いてください．"},
    {"name": "翻訳（スライド用）", "content": "Translate a Japanese presentation manuscript into English for an academic conference speech. The presentation topic is on deep learning, specifically to explain one's own paper. The target audience is experts in the field. The translated document should be concise, allowing for approximately one minute of speech. Additionally, please ensure the English text is grammatically correct, free of errors, and natural-sounding. If there are differences between Japanese grammar, such as tenses or passive voice usage, and natural English expressions, please prioritize naturalness in the English translation. You may also consider breaking down complex sentences for clarity while retaining the intended meaning.\n\n"},
    {"name": "翻訳（論文用）", "content":[
        "Role: Professional English Translator\nConference: The International Conference on Learning Representations (ICLR)\nRevision Degree: Light\nEditing Goal: Simplify language for clarity while maintaining scholarly style and uniformity\nDesired Style: Scholarly, suitable for PhD-level writing but accessible to a wider audience\nTone: Analytical\nAudience: Experts in the field who may also appreciate less technical jargon\nFormat: LaTeX\nProvide Japanese Text for Translating: \"\"",
        "Provide Japanese Text for Translating: \"\""
    ]},
    {"name": "校正（論文用）", "content": [
        "Role: Professional English Proofreader\nConference: The International Conference on Learning Representations (ICLR)\nRevision Degree: Light\nEditing Goal: Simplify language for clarity while maintaining scholarly style and uniformity. You may separate sentences or replace words in the appropriate word order if they have a similar meaning.\nDesired Style: Scholarly, suitable for PhD-level writing but accessible to a wider audience\nTone: Analytical\nAudience: Experts in the field who may also appreciate less technical jargon\nFormat: LaTeX code\nProvide text for proofreading: \"\"",
        "The following is the text of the continuation. Please proofread the text in the same manner while maintaining consistency.\nProvide text for proofreading: \"\""
        ]},
    {"name": "翻訳修正（論文用）", "content": [
        "While maintaining proper style, please revise the relevant parts of the document so that the meaning is the same as the Japanese meaning below.\n Japanese: \"\"\n Sentence before modification: \"\"",
        " Japanese: \"\"\n Sentence before modification: \"\""
    ]},
    {"name": "Notation Table", "content": "PDF論文内のすべての数学記号を漏れなくまとめた、Notation Table(記号一覧表)を日本語で作成してください。加算の+など，一般的によく使われる算術記号は省いてください．以下３つの見出しで表を校正してください．\n記号: 論文中に出現する数学記号そのもの（markdown形式）\n説明: その記号の簡単な説明（日本語）\n数学的定義: ある場合は、記号の厳密な数学的定義\n\n記号は種類(ギリシャ文字、アルファベット，算術記号など)で分類し、マークダウン形式で出力します。\n\n"},
    {"name": "coding", "content": "以下のような仕様を満たすコードを書いてください．必要に応じてファイルを分割してください．\n言語：\n\n仕様：\n- "}
]
